app/Controllers/Cidades.php

SELECT *
FROM `cidades`
---
    public function index(): string
    {
        $session = session();
        $data['title'] = 'Cidades';
        $data['cidades'] = $this->cidades->findAll();