app/Controllers/ClientesController.php

    public function create()
    {
        $usuariosModel = new Usuarios();
        $cidadesModel = new Cidades();

        // Pega todos os usuários
        $usuarios = $usuariosModel->findAll();

        // Filtra os usuários que ainda não são clientes
        $usuariosSemCliente = array_filter($usuarios, function($usuario) {
            return !$this->clientesModel->where('clientes_usuarios_id', $usuario->usuarios_id)->first();
        });

        $data['usuarios'] = $usuariosSemCliente;
        $data['cidades'] = $cidadesModel->findAll();
---
SELECT *
FROM `usuarios`
SELECT *
FROM `clientes`
WHERE `clientes_usuarios_id` = '1'
 LIMIT 1
SELECT *
FROM `cidades`

    public function store()
    {
        $dados = [
            'clientes_usuarios_id' => $this->request->getPost('clientes_usuarios_id'),
            'clientes_cidade_id' => $this->request->getPost('clientes_cidade_id'),
            'clientes_endereco' => $this->request->getPost('clientes_endereco'),
        ];

        if ($this->clientesModel->insert($dados)) {
---
INSERT INTO `clientes` (`clientes_usuarios_id`, `clientes_cidade_id`, `clientes_endereco`) VALUES ('4', '1', 'vila arco iris')