app/Controllers/Login.php

    public function logar()
    {
        $login = $_REQUEST['login'];
        $senha = md5($_REQUEST['senha']);

        $this->data['usuarios'] = $this->usuarios->where('usuarios_cpf',$login)->
        orWhere('usuarios_email',$login)->where('usuarios_senha',$senha)->find();
---
SELECT *
FROM `usuarios`
WHERE `usuarios_cpf` = 'feliperafael769@gmail.com'
OR `usuarios_email` = 'feliperafael769@gmail.com'
AND `usuarios_senha` = '202cb962ac59075b964b07152d234b70'