app/Controllers/Produtos.php

INSERT INTO `produtos` (`produtos_nome`, `produtos_descricao`, `produtos_preco_custo`, `produtos_preco_venda`, `produtos_categorias_id`) VALUES ('Pizza Calabresa', 'Massa, Mussarela, Calabresa e tomate', '40.00', '65.00', '1')
---
    public function create()
    {
        if(!$this->validate([
            'produtos_nome' => 'required|max_length[255]|min_length[3]',
            'produtos_preco_custo' => 'required',
            'produtos_preco_venda' => 'required',
            'produtos_categorias_id' => 'required|integer'
        ])) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        $dados = [
            'produtos_nome' => $this->request->getPost('produtos_nome'),
            'produtos_descricao' => $this->request->getPost('produtos_descricao'),
            'produtos_preco_custo' => moedaDolar($this->request->getPost('produtos_preco_custo')),
            'produtos_preco_venda' => moedaDolar($this->request->getPost('produtos_preco_venda')),
            'produtos_categorias_id' => $this->request->getPost('produtos_categorias_id')
        ];

        $this->produtos->save($dados);

SELECT *
FROM `produtos`
JOIN `categorias` ON `produtos_categorias_id` = `categorias_id`
---
    public function edit($id)
    {
        $data['categorias'] = $this->categorias->findAll();
        $data['produto'] = $this->produtos->find($id);
        if (!$data['produto']) {
            return redirect()->to('/produtos')->with('msg', msg('Produto não encontrado!', 'danger'));