app/Controllers/Venda.php

    public function edit($id = null)
    {
        $venda = $this->vendasModel->find($id);
        if (!$venda) {
            return redirect()->to('/venda')->with('msg', msg('Venda não encontrada', 'danger'));
---
SELECT `vendas`.*, `usuarios`.`usuarios_nome` AS `cliente_nome`
FROM `vendas`
JOIN `clientes` ON `clientes`.`clientes_id` = `vendas`.`vendas_clientes_id`
JOIN `usuarios` ON `usuarios`.`usuarios_id` = `clientes`.`clientes_usuarios_id`